v2206/atmospheric_Microclimate/streetCanyon_CFDHAM/system/leeward/setset.batch
cellSet brick new boxToCell (59.9 0.0 100.0)(60.0 10.0 150.0)
cellZoneSet brick new setToCellZone brick